export const babyFAQData = [
    {
        id:0,
        title: 'Что такое Serviсе Nanny?',
        description: 'Наш сервис – это не просто доска объявлений, это площадка для профессионального роста и развития нянь. Мы предоставляем вам инструменты для успешного поиска работы и постоянного совершенствования своих навыков.',
    },
    {
        id:1,
        title: 'Что нужно, чтобы начать работу?',
        description: `Просто зарегистрироваться, заполнить анкету и пройти короткую проверку. \n
Затем вы сможете откликаться на вакансии или ждать заявки от родителей.
        `
    },
    {
        id:2,
        title: 'Это официальная работа?',
        description: `Да, мы предоставляем договор, который регулирует ваши отношения с родителями. \n
        Это ваша юридическая защита и подтверждение статуса.`
    },
    {
        id:3,
        title: 'Как долго ждать откликов?',
        description: `У большинства нянь первые отклики появляются в течение 3–5 дней после регистрации. \n
        Ваша анкета будет видна в базе, а также вы можете сами писать родителям.`
                
    },
]