export const homeFaqData = [
    {
        id:0,
        title: 'Что такое Serviсе Nanny?',
        description: 'Наш сервис – это не просто доска объявлений, это площадка для профессионального роста и развития нянь. Мы предоставляем вам инструменты для успешного поиска работы и постоянного совершенствования своих навыков.',
    },
    {
        id:1,
        title: 'Что я получу после оплаты Serviсе Nanny?',
        description: `Просто зарегистрироваться, заполнить анкету и пройти короткую проверку. \n  Затем вы сможете откликаться на вакансии или ждать заявки от родителей.
        `
    },
    {
        id:2,
        title: 'Сколько стоит оплата платформы?',
    },
    {
        id:3,
        title: 'Как вы проверяете нянь?',
        description: 'Каждая няня проходит детальную проверку — от паспорта и ИНН до мед. книжек и справок. Мы тщательно отбираем тех, кого допустим к детям.'
        
    },
    {
        id:4,
        title: 'Какие гарантии, что няня подойдёт?',
        description: 'Каждая няня проходит детальную проверку — от паспорта и ИНН до мед. книжек и справок. Мы тщательно отбираем тех, кого допустим к детям.'
    },
    {
        id:5,
        title: 'Можно ли доверить няню ребёнку с особенностями?',
        description: `Да. У нас есть няни с опытом работы с детьми с РАС, СДВГ и другими особенностями. \n
        Вы можете указать это при размещении вакансии — мы поможем найти подходящего специалиста.`
    },    
    {
        id:6,
        title: 'Как оплачивать няню?',
    }
]